-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2019-04-27 09:23:49
-- 伺服器版本： 10.1.38-MariaDB
-- PHP 版本： 7.3.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `gocamping`
--

-- --------------------------------------------------------

--
-- 資料表結構 `event_list`
--

CREATE TABLE `event_list` (
  `event_id` int(11) NOT NULL,
  `event_name` varchar(255) NOT NULL,
  `event_intro` varchar(255) NOT NULL,
  `event_intro2` varchar(255) NOT NULL,
  `event_intro3` varchar(255) NOT NULL,
  `event_applyStart` date NOT NULL,
  `event_applyEnd` date NOT NULL,
  `event_dateStart` date NOT NULL,
  `event_dateEnd` date NOT NULL,
  `event_price` int(11) NOT NULL,
  `camp_id` varchar(255) NOT NULL,
  `event_upLimit` int(11) NOT NULL,
  `event_shelf` int(11) NOT NULL,
  `event_remark` varchar(255) NOT NULL,
  `event_img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `event_list`
--

INSERT INTO `event_list` (`event_id`, `event_name`, `event_intro`, `event_intro2`, `event_intro3`, `event_applyStart`, `event_applyEnd`, `event_dateStart`, `event_dateEnd`, `event_price`, `camp_id`, `event_upLimit`, `event_shelf`, `event_remark`, `event_img`) VALUES
(1, '追逐星空的旅程', ' 有璀璨銀河的營區，是感受耶誕氣氛的最好去處！尤其是無光害的營區，星光佈滿大片黑布，燦爛星空想看多久都沒問題。耶誕佳節將至，親友小聚烤肉、交換禮物，在帳篷外披上耶誕燈就很有感覺。露營樂精選出無光害露營區，晚上烤肉看星星，最適合小團露、親子同行！ ', '    ', '    ', '2019-03-24', '2019-04-21', '2019-05-18', '2019-05-19', 3000, '1', 40, 1, '  ', 'aurora.jpg'),
(4, '- 誰是小當家 ●用美味料裡來一決勝負吧！-', '露營活動大部分都需要自己準備餐點，但如果你已經吃膩了單純的烤肉、火鍋，是不是應該來點不一樣的呢？', '讓我們把理所當然的料理變成更有趣的遊戲吧！召集左鄰右舍，每個人或每組負責一道菜色進行 PK 大賽，除了讓餐桌更豐盛外，在比賽的過程中還能讓大家發揮創意、激盪出更多有趣的美味料理，快一起來爭奪特級廚師的寶座吧！', '位於新竹關西鎮的「樸真園」擁有三萬坪的純淨天地，園區堅持三十年的不灑農藥，也讓鳥類、昆蟲等動物自在地穿梭其中 ~\r\n\r\n而這裡也是一處相對奢華便利的露營選擇，除了幫你把烹飪用具都準備好好外，營帳內的環境好像家一般的舒適，最適合給想露營又不希望太奔波狼狽的你，來這片如畫的風景中待上兩天一夜，絕對讓你身心充飽滿滿的能量！', '2019-04-11', '2019-04-26', '2019-06-29', '2019-06-30', 3500, '7', 35, 0, '', 'Junior Chef.jpg'),
(5, '─ 愛玩遊戲咖  ●人多人少都能玩 ─', '互動式的遊戲，似乎是一種能快速拉近人與人之間距離的活動了，不論是熟識的朋友、或者初次見面的同團夥伴，只要一起加入戰局就能快速地跳離尷尬無聊的時光，直接讓人熱血沸騰！', '沒有準備道具的你，可以選擇類似殺手遊戲類型的活動，只要有足夠的人數即可進行；當然，如果你的行囊空間足夠的話，可以帶些簡單的撲克牌、桌遊等等，又或者你可以挑選恐怖戳戳樂和超可愛的復古彈珠台等趣味遊戲道具，都可以讓你們在露營的過程中度過好玩又歡樂的時光。 ', '          ', '2019-04-07', '2019-05-05', '2019-07-20', '2019-07-21', 3000, '23', 20, 0, '     ', 'enjoy.jpg'),
(6, '女孩的露營派對：專屬女生的Outdoor Party', '是時候擺脫裝備至上、又貴又重的汽車露營（Auto Camping）了，跟著一群名為「蘑菇女孩」的女子露營團隊，帶上實用兼具個人特色的裝備，從搭帳棚到料理、遊戲等，自己一手包辦這場令人興奮的露營吧！', '  ', '  ', '2019-06-01', '2019-06-16', '2019-07-22', '2019-07-23', 4000, '3', 30, 3, '● 約 6月下旬開放報名，敬請期待', 'girlspower.jpg'),
(7, '─ Family Day 新森活露營趣 ● 一起擁抱野趣生活 ─', '號召車壇最具凝聚力的車主，一同走出戶外徜徉山林，並透過一連串精彩活動內容，緊密連結車主、親子、家人以及品牌之間的深厚情誼，寫下與Subaru的精采故事。', '活動採用全露營擁抱野趣生活的住宿模式，期盼每一位參與車主能夠遠離塵囂，駕馭著自己所鍾愛的Subaru汽車，駛入宛如世外桃源般的「不遠露營度假山莊」，盡情享受一系列精采活動內容，包含專業露營講座、熱情奔放營火晚會、活力四射樂團表演、令人樂不可支互動遊戲、重視團隊精神家庭大地闖關遊戲，Subaru邀請車主們一同參與、體現Subaru「豐富人車生活」的品牌精神。', '  ', '2019-05-05', '2019-06-09', '2019-08-03', '2019-08-04', 4000, '2', 30, 0, ' ', 'familycamping.jpg'),
(8, 'TOY STORY 4 ● 結訓手刀進威秀', '   Woody has always been confident about his place in the world and that his priority is taking care of his kid, whether that’s Andy or Bonnie. But when Bonnie adds a reluctant new toy called “Forky” to her room, a road trip adventure alongside old and ne', '          ', '          ', '2019-04-01', '2019-04-30', '2019-06-21', '2019-06-21', 300, '17', 100, 0, '     ', 'Toy_Story_4_poster.jpg'),
(9, '─ 寶貝親子咖 ●自己的帳篷自己搭，讓孩子學會動手做 ─', '「小松鼠帶你去露營」除了有親子同歡的趣味遊戲、也安排了夜間音樂演唱會、星空電影院等活動，非常適合新手露客們，只要帶著衣服及少少的用品，輕輕鬆鬆就可以出發露營去！', '  帶著家中小寶貝的把把麻麻，還沒想好要做什麼活動才能讓孩子玩得開心嗎？\r\n\r\n「小松鼠帶你去露營」除了有親子同歡的趣味遊戲、也安排了夜間音樂演唱會、星空電影院等活動，非常適合新手露客們，只要帶著衣服及少少的用品，輕輕鬆鬆就可以出發露營去！\r\n\r\n另外，在這裡孩子們能找到一起開心共樂的玩伴，讓爸媽們放鬆地在一旁聊聊天呢。', '  ', '2019-05-05', '2019-05-19', '2019-06-16', '2019-06-17', 3500, '3', 50, 0, '', 'family.jpg'),
(11, '─ 熱情探險咖 ●跟著教練登頂吧 ─', '擁有滿腔熱血的你，不該只是待在舒適的營區而已，快揹著你的行囊、撐起手中的拐杖、一步步地征服高山百岳吧！在合歡山小溪營地中，不只可體驗野營的樂趣，更能獲得登百岳的殊榮，同時，享受無與倫比的絕美景致！ ', '  登山還要自己準備露營裝備，想到這你是不是已經打退堂鼓了呢？別擔心！貼心的「眺躍鳥」只要你準備個人睡袋，其他都已經幫你打點妥當了呢！', '  位於合歡山北峰下約 1 公里處的小溪營地，有冷杉林圍繞、鄰近潺潺溪流，白天可坐臥草皮，眺望雄偉中央山脈群峰，夜晚可躺下仰望如細沙般的星空，從登山口至小溪營地，小小的健行路程僅需 3 公里，跟著教練的腳步調整節奏，保證你也能輕鬆抵達。', '2019-06-16', '2019-06-30', '2019-08-30', '2019-08-31', 4000, '5', 30, 0, ' ', 'advanture.jpg'),
(14, '─ 感性浪漫咖專屬 ●星空電影院─', '小小的微型投影機，就算沒有屏幕也能打在帳篷上，在星空下沒有戲院的包袱，不需要輕聲細語、不會禁止攜帶外食，你可以開懷地大笑、也能感動地大哭，只要緊靠著身旁的家人朋友，就能感受最浪漫的星空電影...', '    \r\n如果說夜晚的滿天星空是露營最該享受的浪漫體驗，那你更應該早起看日出，體會那冉冉升起的旭日，延續前晚', '   \r\n如果說夜晚的滿天星空是露營最該享受的浪漫體驗，那你更應該早起看日出，體會那冉冉升起的旭日，延續前晚大自然現象所帶來的美好感動！ \r\n清水斷崖位於花蓮清水山東側，其地勢險峻、絕壁臨海面長達 5 公里非常壯觀，這是行經蘇花公路的必看景點，也是台灣十景之一。來到這裡，你可以體驗在無光害的環境下享受星空露營、更能早', '2019-04-11', '2019-04-26', '2019-06-29', '2019-06-30', 2500, '6', 50, 0, '     ', 'opencinema.jpg'),
(20, '─ 歡樂歌舞咖 ●即興舞蹈，開心就好 ─', '在豐盛的晚飯後，鄒族藝術家 ─ 不舞就要帶你展開一場夜晚部落音樂會了，平時會有愛熱鬧的大哥、大姐們，與你一同彈吉他、歌唱度過歡樂的夜晚 ~ 如果你很幸運，遇到村落內的特別活動或慶典，那將會是令人開心難忘的一夜呢！ ', '  ●森林音樂會響起大自然的絕美樂章  ', '  在阿里山上有一處星空帳篷，沒有城市喧囂，只有兩頂透明帷幕的帳篷，要讓你躺在床上也能望向滿天星斗，這山間的夜晚有盛宴、有美酒，那怎麼能少了助興的音樂呢？\r\n\r\n在豐盛的晚飯後，鄒族藝術家 ─ 不舞就要帶你展開一場夜晚部落音樂會了，平時會有愛熱鬧的大哥、大姐們，與你一同彈吉他、歌唱度過歡樂的夜晚 ~ 如果你很幸運，遇到村落內的特別活動或慶典，那將會是令人開心難忘的一夜呢！  ', '2019-04-20', '2019-05-20', '2019-07-10', '2019-07-11', 2200, '20', 30, 0, '   ', 'dance-africa-footprint-s1-mask9.jpg'),
(22, '一起露營追寶趣', '  在指定露營地的道館中打贏任一隻佔領的寶可夢，即可獲得資格  ', '  獲得寶可夢 露營樹懶 一隻  ', '  粉絲團按讚分享，再送999皮卡丘幣  ', '2019-03-22', '2019-03-31', '2019-04-01', '2019-04-01', 20, '19', 3, 1, '  ', 'pokemon.jpg'),
(23, 'test delete', '   test delete   ', '      ', '      ', '2019-04-05', '2019-04-22', '2019-04-27', '2019-04-28', 200, '3', 8, 1, '   ', 'testing.jpg'),
(24, 'delete', '      delete     ', '            ', '            ', '2019-04-05', '2019-04-19', '2019-04-27', '2019-04-27', 20, '12', 30, 1, '      ', 'delete.jpg'),
(27, 'camping is an attitude', ' just do it! ', '  ', '  ', '2019-04-13', '2019-04-27', '2019-04-26', '2019-04-30', 3500, '15', 30, 1, ' ', '78009b0c6c96495c183333b9182075c765c57cef.jpg');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `event_list`
--
ALTER TABLE `event_list`
  ADD PRIMARY KEY (`event_id`);

--
-- 在傾印的資料表使用自動增長(AUTO_INCREMENT)
--

--
-- 使用資料表自動增長(AUTO_INCREMENT) `event_list`
--
ALTER TABLE `event_list`
  MODIFY `event_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
