-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2019-03-17 13:04:56
-- 伺服器版本： 10.1.38-MariaDB
-- PHP 版本： 7.3.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `gocamping`
--

-- --------------------------------------------------------

--
-- 資料表結構 `event_list`
--

CREATE TABLE `event_list` (
  `event_id` int(11) NOT NULL,
  `event_name` varchar(255) NOT NULL,
  `event_intro` varchar(255) NOT NULL,
  `event_intro2` varchar(255) NOT NULL,
  `event_intro3` varchar(255) NOT NULL,
  `event_applyStart` date NOT NULL,
  `event_applyEnd` date NOT NULL,
  `event_dateStart` date NOT NULL,
  `event_dateEnd` date NOT NULL,
  `event_price` int(11) NOT NULL,
  `camp_id` varchar(255) NOT NULL,
  `event_upLimit` int(11) NOT NULL,
  `event_shelf` int(11) NOT NULL,
  `event_remark` varchar(255) NOT NULL,
  `event_imgName` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `event_list`
--

INSERT INTO `event_list` (`event_id`, `event_name`, `event_intro`, `event_intro2`, `event_intro3`, `event_applyStart`, `event_applyEnd`, `event_dateStart`, `event_dateEnd`, `event_price`, `camp_id`, `event_upLimit`, `event_shelf`, `event_remark`, `event_imgName`) VALUES
(1, 'firefly', '每年4、5月間是螢火蟲大量出沒的季節，當夜晚到來螢火蟲便點亮一盞盞微光穿梭草叢間，不僅為了求偶也有警告敵人的作用；近年來「賞螢」也成為夜間生態旅遊的熱門活動，小編特別為大家整理全台最推賞螢地點及攻略，一起去欣賞可愛「火金姑」發出愛的光芒吧！', '', '', '2019-03-24', '2019-04-21', '2019-05-18', '2019-05-19', 3000, 'loca01', 40, 0, '', ''),
(2, 'firefly', '每年4、5月間是螢火蟲大量出沒的季節，當夜晚到來螢火蟲便點亮一盞盞微光穿梭草叢間，不僅為了求偶也有警告敵人的作用；近年來「賞螢」也成為夜間生態旅遊的熱門活動，小編特別為大家整理全台最推賞螢地點及攻略，一起去欣賞可愛「火金姑」發出愛的光芒吧！', '', '', '2019-05-05', '2019-06-02', '2019-07-13', '2019-07-14', 3000, 'loca01', 40, 0, '', ''),
(3, 'star', '象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底沒有...', '', '', '2019-05-05', '2019-06-09', '2019-08-03', '2019-08-04', 4000, 'loca02', 30, 0, '', ''),
(4, 'star', '象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底沒有...', '', '', '2019-05-01', '2019-05-31', '2019-07-13', '2019-07-14', 4000, 'loca02', 30, 0, '', ''),
(5, 'star', '象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底沒有...', '', '', '2019-06-09', '2019-06-30', '2019-09-07', '2019-09-08', 4000, 'loca02', 30, 0, '', ''),
(6, '狂奔吧！流星雨', ' 象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底沒有... ', '', '', '2019-06-01', '2019-06-16', '2019-07-22', '2019-07-23', 4000, 'loca02', 30, 0, ' ', ''),
(7, 'star', '象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底沒有...', '', '', '2019-06-16', '2019-06-30', '2019-08-18', '2019-08-19', 4000, 'loca02', 30, 0, '', ''),
(8, 'star５０', '象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底沒有...象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底.mark and ', '', '', '2019-05-19', '2019-06-02', '2019-07-05', '2019-07-06', 4000, 'loca02', 30, 0, '', ''),
(9, '親子同樂', '打造一個專注、輕鬆、愉悅的親子互動空間，以「啟發更多快樂的親子關係，創造更多親密家庭」為目的，鼓勵父母帶著寶貝一同來探索創意的親子互動！', '', '', '2019-05-05', '2019-05-19', '2019-06-16', '2019-06-17', 3500, 'loca_05', 50, 0, 'gsdffd', ''),
(10, '親子同樂2', '打造一個專注、輕鬆、愉悅的親子互動空間，以「啟發更多快樂的親子關係，創造更多親密家庭」為目的，鼓勵父母帶著寶貝一同來探索創意的親子互動！打造一個專注、輕鬆、愉悅的親子互動空間，以「啟發更多快樂的親子關係，創造更多親密家庭」為目的，鼓勵父母帶著寶貝一同來探索創意的親子互動！', '', '', '2019-06-01', '2019-06-15', '2019-07-31', '2019-08-02', 5500, 'loca_05', 50, 0, '', ''),
(11, '小小釣魚王', '打造一個專注、輕鬆、愉悅的親子互動空間，以「啟發更多快樂的親子關係，創造更多親密家庭」為目的，鼓勵父母帶著寶貝一同來探索創意的親子互動！', '', '', '2019-06-16', '2019-06-30', '2019-08-30', '2019-08-31', 4000, 'camp_99', 30, 0, '', ''),
(12, 'firefly', '每年4、5月間是螢火蟲大量出沒的季節，當夜晚到來螢火蟲便點亮一盞盞微光穿梭草叢間，不僅為了求偶也有警告敵人的作用；近年來「賞螢」也成為夜間生態旅遊的熱門活動，小編特別為大家整理全台最推賞螢地點及攻略，一起去欣賞可愛「火金姑」發出愛的光芒吧！', '', '', '2019-04-07', '2019-05-05', '2019-06-15', '2019-06-16', 3000, 'loca033', 40, 0, '', ''),
(13, 'star', ' 象局天文站指出，象限儀座流星雨極大期將出現在1月4日，預估每小時最多有110顆流星，適逢農曆月底沒有... ', '  ', '  ', '2019-04-01', '2019-05-01', '2019-06-22', '2019-06-23', 4000, 'loca02', 30, 0, ' ', ''),
(14, '都市俗，一起拔菜吧！', '   迎接暑假來臨，雲林縣府輔導社區推出山線、海線、平原共15條遊程，一年四季都可造訪，也有季節限定的農事體驗，包括拔蘿蔔體驗、拔花生體驗、煮醬油體驗等。\r\n\r\n現代人生活繁忙，接觸大自然最療育，雲林縣是台灣農業生產基地，縣府文化處綜合三年來的口碑，今夏推出農村體驗遊程，適合親子共遊，也潛移默化食農教育，深度成呈現農村魅力。   ', '  ', '  ', '2019-04-11', '2019-04-26', '2019-06-29', '2019-06-30', 2500, 'camp_55', 50, 0, '   ', ''),
(15, '小小釣魚王', '   在翡翠般夢幻的海平面上體驗2小時的海釣之旅☆適合少數人參加。釣到的魚可以帶回家！！請於1天4班的船班中選擇喜歡的時間(^^♪冲绳不僅被大量珊瑚礁圍繞， 在翡翠般夢幻的海平面上體驗2小時的海釣之旅☆適合少數人參加。釣到的魚可以帶回家！！請於1天4班的船班中選擇喜歡的時間(^^♪冲绳不僅被大量珊瑚礁圍繞， ...   ', ' aaaaaaaaaa僅被大量珊瑚礁圍繞， 在翡翠般夢幻的海平面上體驗2小時的海釣之旅☆適合少數人參加。釣到的魚可以帶回家！！請於1天4班的船班中aaaaaaaaaaaaaaaaaaaa ', '    在翡翠般夢幻的海平面上體驗2小時的海釣之旅☆適合少數人參加。釣到的魚可以帶回家！！請於1天4班的船班中選擇喜歡的時間(  ', '2019-04-11', '2019-04-26', '2019-06-29', '2019-06-30', 3500, 'camp_23', 30, 0, '   ', ''),
(16, '親子同樂 笑呵呵', '2019更新❤好玩的【大台北室內親子景點】懶人包-室內遊戲場/免費親子館/親子餐廳/博物館~豔陽天~下雨天~ 輕鬆遛小孩的親子好去處~ ...', '  ', '  ', '2019-04-11', '2019-04-26', '2019-06-29', '2019-06-30', 3500, 'camp_11', 35, 0, ' ', '');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `event_list`
--
ALTER TABLE `event_list`
  ADD PRIMARY KEY (`event_id`);

--
-- 在傾印的資料表使用自動增長(AUTO_INCREMENT)
--

--
-- 使用資料表自動增長(AUTO_INCREMENT) `event_list`
--
ALTER TABLE `event_list`
  MODIFY `event_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
